app/Controllers/Fakultas.php

SELECT *
FROM `ruangan`
SELECT *
FROM `prodi`
---
    public function index()
    {

        //get Ruangan Data
        $fakultas['ruangan'] = $this->ruanganModel->findAll();
        $fakultas['prodi'] = $this->prodiModel->findAll();

INSERT INTO `fakultas` (`kd_fakultas`, `nama_fakultas`, `id_ruangan`, `id_prodi`) VALUES ('F017003', 'mmbm', '1', '3')
---
    function createNewFakultas()
    {
        $newKodeFakultas = $this->fakultasModel->generateKodeFakultas();
        $data = [
            'kd_fakultas' => $newKodeFakultas,
            'nama_fakultas' => $this->request->getPost('nama_fakultas'),
            'id_ruangan' => $this->request->getPost('id_ruangan'),
            'id_prodi' => $this->request->getPost('id_prodi')
        ];
        $this->fakultasModel->insert($data);

SELECT *
FROM `ruangan`
SELECT *
FROM `prodi`
SELECT *
FROM `fakultas`
WHERE `fakultas`.`id_fakultas` = '14'
---
    public function edit($id_fakultas)
    {
        //getData Ruangan
        $data['ruangan'] = $this->ruanganModel->findAll();
        $data['prodi'] = $this->prodiModel->findAll();

        //edit func
        $data['title'] = "Edit Fakultas";
        $data['fakultas'] = $this->fakultasModel->find($id_fakultas);

UPDATE `fakultas` SET `nama_fakultas` = 'ab', `id_ruangan` = '1', `id_prodi` = '1'
WHERE `fakultas`.`id_fakultas` IN ('14')
---
    public function update($id_fakultas)
    {
        $data = [
            'nama_fakultas' => $this->request->getPost('nama_fakultas'),
            'id_ruangan' => $this->request->getPost('id_ruangan'),
        ];

        $this->fakultasModel->update($id_fakultas, $data);

DELETE FROM `fakultas`
WHERE `id` IN ('2')
---
    public function delete($id_fakultas)
    {
        $this->fakultasModel->delete($id_fakultas);