app/Controllers/Fakultas.php

SELECT *
FROM `fakultas`
---
    public function index()
    {
        $fakultas['title'] = 'Fakultas';
        $fakultas['fakultas'] = $this->model->findAll();