app/Controllers/Home.php

SELECT *
FROM `fakultas`
SELECT *
FROM `ruangan`
SELECT *
FROM `prodi`
---
    public function index()
    {
        $fakultasModel = new FakultasModel();
        $ruanganModel = new RuanganModel();
        $prodiModel = new ProdiModel();

        $data['fakultas'] = $fakultasModel->findAll();
        $data['totalFakultas'] = $fakultasModel->countFakultasData();
        $data['ruangan'] = $ruanganModel->findAll();
        $data['totalRuangan'] = $ruanganModel->countRuanganData();
        $data['prodi'] = $prodiModel->findAll();