app/Controllers/KelasController.php

    public function index()
    {
        $data['title'] = 'Kelas';
        $data['dataKelas'] = $this->model->orderBy('id_kelas', 'asc')->findAll();
---
SELECT *
FROM `kelas`
ORDER BY `id_kelas` ASC

    public function editKelas($id_kelas)
    {
        // Mengambil data ruangan yang akan diedit dari database
        $data['title'] = "Edit Kelas";
        $data['kelas'] = $this->model->find($id_kelas);

        // Validasi data yang dikirimkan dari form
        $validation = \Config\Services::validation();
        $validation->setRules([
            'kd_kelas' => 'required',
            'nama_kelas' => 'required'
        ]);

        // Jalankan validasi
        if ($this->request->getMethod() === 'post') {
            // Jalankan validasi
            $isValid = $validation->withRequest($this->request)->run();
            if ($isValid) {
                // Jika data valid, lakukan pembaruan ke database
                $this->model->update($id_kelas, [
                    'kd_kelas' => $this->request->getPost('kd_kelas'),
                    'nama_kelas' => $this->request->getPost('nama_kelas')
                ]);
---
SELECT *
FROM `kelas`
WHERE `kelas`.`id_kelas` = '2'
UPDATE `kelas` SET `kd_kelas` = 'R017001', `nama_kelas` = 'jasbdaa'
WHERE `kelas`.`id_kelas` IN ('2')