app/Controllers/ProdiController.php

SELECT *
FROM `prodi`
ORDER BY `id_prodi` ASC
---
    public function index()
    {
        $data['title'] = 'prodi';
        $data['dataProdi'] = $this->model->orderBy('id_prodi', 'asc')->findAll();

INSERT INTO `prodi` (`kd_prodi`, `nama_prodi`) VALUES ('R017004', 'PGSD')
---
    function addprodi()
    {

        $newKode = $this->model->generateKodeprodi();

        $namaprodi = $this->request->getPost('nama_prodi');

        $this->model->insert([
            'kd_prodi' => $newKode,
            'nama_prodi' => $namaprodi
        ]);

SELECT *
FROM `prodi`
WHERE `prodi`.`id_prodi` = '1'
---
    public function editProdi($id_prodi)
    {
        // Mengambil data ruangan yang akan diedit dari database
        $data['title'] = "Edit Prodi";
        $data['prodi'] = $this->model->find($id_prodi);

DELETE FROM `prodi`
WHERE `id_prodi` IN ('5')
---
    function deleteProdi($id_prodi)
    {

        $this->model->delete($id_prodi);