app/Controllers/RuanganController.php

SELECT *
FROM `ruangan`
ORDER BY `id_ruangan` ASC
---
    public function index()
    {
        $data['dataRuangan'] = $this->model->orderBy('id_ruangan', 'asc')->findAll();