app/Models/FakultasModel.php

    function generateKodeFakultas()
    {
        $lastKode = $this->orderBy('id', 'DESC')->first();
---
SELECT *
FROM `fakultas`
ORDER BY `id` DESC
 LIMIT 1