app/Models/FakultasModel.php

    function countFakultasData()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `fakultas`

    function generateKodeFakultas()
    {
        $lastKode = $this->orderBy('id_fakultas', 'DESC')->first();
---
SELECT *
FROM `fakultas`
ORDER BY `id_fakultas` DESC
 LIMIT 1

    function getData()
    {
        $builder = $this->db->table('fakultas')
            ->join('ruangan', 'ruangan.id_ruangan = fakultas.id_ruangan')
            ->join('prodi', 'prodi.id_prodi = fakultas.id_prodi')
            ->get()->getResult();
---
SELECT *
FROM `fakultas`
JOIN `ruangan` ON `ruangan`.`id_ruangan` = `fakultas`.`id_ruangan`
JOIN `prodi` ON `prodi`.`id_prodi` = `fakultas`.`id_prodi`