app/Models/ProdiModel.php

SELECT COUNT(*) AS `numrows`
FROM `prodi`
---
    function countProdiData()
    {
        return $this->countAllResults();

SELECT *
FROM `prodi`
ORDER BY `id_prodi` DESC
 LIMIT 1
---
    function generateKodeProdi()
    {
        $lastKode = $this->orderBy('id_prodi', 'DESC')->first();