app/Models/RuanganModel.php

SELECT COUNT(*) AS `numrows`
FROM `ruangan`
---
    function countRuanganData()
    {
        return $this->countAllResults();